lobcder-tests/etc/tsung.xml
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="1">
        </client>
    </clients>
    <servers>
        <server host="localhost" port="8080" type="tcp"/>
    </servers>
    <load>
        <arrivalphase phase="1" duration="20" unit="second">
            <users maxnumber="1" arrivalrate="1" unit="second"/>
        </arrivalphase>
    </load>
    <options>
        <option type="ts_http" name="user_agent">
            <user_agent probability="100">Benchmark</user_agent>
        </option>
    </options>
    <sessions>
        <session name="http-example" probability="100" type="ts_http">
            <request>
                <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
                <http url="/lobcder/dav/file10MB" method="GET">
                    <www_authenticate userid="user" passwd="pass"/>
                </http>
            </request>
            <repeat name="redirect_loop" max_repeat="1">
                <request subst="true">
                    <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
                    <http url="%%_redirect%%" method="GET"/>
                </request>
                <until var="redirect" eq=""/>
            </repeat>
        </session>
    </sessions>
</tsung>