lobcder-tests/etc/tsung_OPTIONS.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

    <!-- Client side setup -->
    <clients>
        <client host="localhost" use_controller_vm="true"/>
    </clients>
  
    <!-- Server side setup -->
    <servers>
        <server host="localhost" port="8080" type="tcp"></server>
    </servers>

    <!-- to start os monitoring (cpu, network, memory). Use an erlang
    agent on the remote machine or SNMP. erlang is the default --> 
    <!--    <monitoring>
        <monitor host="localhost" type="snmp"></monitor>
    </monitoring>-->
   

  
    <load>
        <arrivalphase phase="1" duration="30" unit="second">
            <users maxnumber="200" arrivalrate="20" unit="second"/>
        </arrivalphase>
    </load>

    <options>
        <option type="ts_http" name="user_agent">
            <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
            <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
        </option>
    </options>

    <!-- start a session for a http user. the probability is the
    frequency of this type os session. The sum of all session's
    probabilities must be 100 -->

    <sessions>
        <session name='rec20150402-1830' probability='100'  type='ts_webdav'>
            <request>
                <http url='/lobcder/dav/' version='1.1' method='OPTIONS'>
                    <www_authenticate userid="user" passwd="pass" />
                </http>
            </request>
        </session>
    </sessions>
</tsung>